Collector v 2.1.00/app/controllers/behaviors_controller.rb

SELECT `behaviors`.* FROM `behaviors`  WHERE `behaviors`.`active` = 1  ORDER BY `behaviors`.`behavior_name` ASC
---
  def index
    #Returns all active Behavior records sorted by name
    @behavior_array = Behavior.all.where(active: true).order(behavior_name: :asc)

SELECT  `behaviors`.* FROM `behaviors`  WHERE `behaviors`.`id` = 10 LIMIT 1
---
  def edit
    @behavior = Behavior.find(params[:behavior_id])

SELECT `patientbehaviors`.`behavior_id` FROM `patientbehaviors`  WHERE `patientbehaviors`.`patient_id` = 2
SELECT `behaviors`.`behavior_name` FROM `behaviors`  WHERE `behaviors`.`id` = 2 AND `behaviors`.`active` = 1
---
  def pv_behavior_record_arrays
      @behavior_id_array = []
      @behavior_name_array = []

      #Query Patientbehavior table for records that match the patient ids in the patient_id_array
      #This will return an array of records for each patient id. We then extract the behavior ids and store it
      for i in session[:patient_id_array]
        @behavior_id_array.push(Patientbehavior.where(patient_id: i).pluck(:behavior_id))
      end

      for j in @behavior_id_array #behavior_id_array is an array of arrays. Each inner array
        temp = []
        for k in j                         #correponds to a different patient
          #Query Behavior table for records that match the behavior ids in the inner arrays of patient_id_array
          #Extract only the active behavior names and store it
          name = Behavior.where(id: k, active: true).pluck(:behavior_name)[0]