Collector v 2.1.00/app/controllers/patients_controller.rb

  def index
    session[:duplicate_patient_show_behavior_flag] = 1
    #Returns all active Patient records sorted by name
    @patient_array = Patient.all.where(active: true).order(patient_name: :asc)
---
SELECT `patients`.* FROM `patients`  WHERE `patients`.`active` = 1  ORDER BY `patients`.`patient_name` ASC

  def pv_patient_record_arrays
    #Query Patientprovider table for records in which the provider_id matches the provider_id of the provider that's logged in
    #Take only the patient ids from the returned records and store it
    session[:patient_id_array] = Patientprovider.where(provider_id: session[:self_provider_id]).pluck(:patient_id)
    session[:patient_name_array] = []


    for p in session[:patient_id_array]
      #Query Patient table for records in which the id matches the patient_id
      #Take only the active patient names from the returned records and store it
      session[:patient_name_array].push(Patient.where(id: p, active: true).pluck(:patient_name)[0])
---
SELECT `patientproviders`.`patient_id` FROM `patientproviders`  WHERE `patientproviders`.`provider_id` = 2
SELECT `patients`.`patient_name` FROM `patients`  WHERE `patients`.`id` = 2 AND `patients`.`active` = 1